bezier_airfoil/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		(-3.0 0.0 -0.078)	//	0
		(-3.0 0.0 0.078)	//	1
		(-0.043664858396365816 -3.0 -0.078)	//	2
		(-0.043664858396365816 -3.0 0.078)	//	3
		(-0.3 0.0 -0.078)	//	4
		(-0.3 0.0 0.078)	//	5
		(-0.043664858396365816 0.0041392121577377445 -0.078)	//	6
		(-0.043664858396365816 0.0041392121577377445 0.078)	//	7
		(-0.043664858396365816 3.0 -0.078)	//	8
		(-0.043664858396365816 3.0 0.078)	//	9
		(-0.003553 3.0 -0.078)	//	10
		(-0.003553 3.0 0.078)	//	11
		(2.996444 0.0 -0.078)	//	12
		(2.996444 0.0 0.078)	//	13
		(-0.003553 -3.0 -0.078)	//	14
		(-0.003553 -3.0 0.078)	//	15
		(0.0 0.0 -0.078)	//	16
		(0.0 0.0 0.078)	//	17
		(-0.043664858396365816 -0.0041392121577377445 -0.078)	//	18
		(-0.043664858396365816 -0.0041392121577377445 0.078)	//	19
		(0.0 0.0 -0.078)	//	20
		(0.0 0.0 0.078)	//	21
		(-0.003556 0.003556 -0.078)	//	22
		(-0.003556 0.003556 0.078)	//	23
		(-0.003555 0.0037338000000000002 -0.078)	//	24
		(-0.003555 0.0037338000000000002 0.078)	//	25
		(-0.0035540000000000003 0.0039624000000000005 -0.078)	//	26
		(-0.0035540000000000003 0.0039624000000000005 0.078)	//	27
		(-0.043664858396365816 0.0041392121577377445 -0.078)	//	28
		(-0.043664858396365816 0.0041392121577377445 0.078)	//	29
		(-0.003556 -0.003556 -0.078)	//	30
		(-0.003556 -0.003556 0.078)	//	31
		(-0.003555 -0.0037338000000000002 -0.078)	//	32
		(-0.003555 -0.0037338000000000002 0.078)	//	33
		(-0.0035540000000000003 -0.0039624000000000005 -0.078)	//	34
		(-0.0035540000000000003 -0.0039624000000000005 0.078)	//	35
		(-0.043664858396365816 -0.0041392121577377445 -0.078)	//	36
		(-0.043664858396365816 -0.0041392121577377445 0.078)	//	37
);

blocks
(
		hex ( 4 28  8  0  5 29  9  1) (100 80 1) edgeGrading (50 1 1 50 1500 1500 1500 1500 1 1 1 1) // 0
		hex (28 26 10  8 29 27 11  9) (25 80 1) simpleGrading (0.1  1500  1) // 1
		hex (26 34 14 10 27 35 15 11) (80 80 1) simpleGrading ( 1  1500  1) // 2
		hex (34 36  2 14 35 37  3 15) (25 80 1) simpleGrading (10  1500  1) // 3
		hex (36  4  0  2 37  5  1  3) (100 80 1) edgeGrading (.02 1 1 .02 1500 1500 1500 1500 1 1 1 1) // 4
		hex (24 32 34 26 25 33 35 27) (80 5 1) simpleGrading ( 1  1  1) // 5
		hex (22 30 32 24 23 31 33 25) (80 5 1) simpleGrading ( 1  1  1) // 6
);

edges
(
		arc  8  0  90.0  (0 0 1)
		arc  9  1  90.0  (0 0 1)
		arc  0  2  90.0  (0 0 1)
		arc  1  3  90.0  (0 0 1)
		arc 14 10 180.0  (0 0 1)
		arc 15 11 180.0  (0 0 1)
		arc 30 22 180.0  (0 0 1)
		arc 31 23 180.0  (0 0 1)
		arc 32 24 180.0  (0 0 1)
		arc 33 25 180.0  (0 0 1)
		arc 34 26 180.0  (0 0 1)
		arc 35 27 180.0  (0 0 1)
		spline 4 28 (
							(-0.29993017  0.0005169  -0.078     )
							(-0.29972306  0.00102521 -0.078     )
							(-0.29938219  0.00152518 -0.078     )
							(-0.29891105  0.00201701 -0.078     )
							(-0.29831309  0.00250088 -0.078     )
							(-0.2975917   0.00297692 -0.078     )
							(-0.29675024  0.00344525 -0.078     )
							(-0.29579204  0.00390597 -0.078     )
							(-0.29472036  0.00435913 -0.078     )
							(-0.29353842  0.00480476 -0.078     )
							(-0.29224943  0.00524288 -0.078     )
							(-0.29085651  0.00567347 -0.078     )
							(-0.28936276  0.00609649 -0.078     )
							(-0.28777123  0.00651189 -0.078     )
							(-0.28608494  0.00691959 -0.078     )
							(-0.28430684  0.00731948 -0.078     )
							(-0.28243984  0.00771146 -0.078     )
							(-0.28048683  0.00809538 -0.078     )
							(-0.27845062  0.00847109 -0.078     )
							(-0.276334    0.00883843 -0.078     )
							(-0.27413969  0.00919722 -0.078     )
							(-0.27187038  0.00954726 -0.078     )
							(-0.26952871  0.00988835 -0.078     )
							(-0.26711728  0.01022026 -0.078     )
							(-0.26463862  0.01054278 -0.078     )
							(-0.26209524  0.01085565 -0.078     )
							(-0.25948958  0.01115864 -0.078     )
							(-0.25682404  0.01145149 -0.078     )
							(-0.25410098  0.01173394 -0.078     )
							(-0.2513227   0.01200574 -0.078     )
							(-0.24849146  0.0122666  -0.078     )
							(-0.24560945  0.01251627 -0.078     )
							(-0.24267885  0.01275446 -0.078     )
							(-0.23970174  0.0129809  -0.078     )
							(-0.2366802   0.01319533 -0.078     )
							(-0.23361622  0.01339746 -0.078     )
							(-0.23051177  0.01358703 -0.078     )
							(-0.22736874  0.01376376 -0.078     )
							(-0.224189   0.0139274 -0.078    )
							(-0.22097435  0.01407769 -0.078     )
							(-0.21772653  0.01421438 -0.078     )
							(-0.21444725  0.01433722 -0.078     )
							(-0.21113816  0.01444598 -0.078     )
							(-0.20780086  0.01454042 -0.078     )
							(-0.20443688  0.01462035 -0.078     )
							(-0.20104772  0.01468555 -0.078     )
							(-0.19763482  0.01473582 -0.078     )
							(-0.19419956  0.014771   -0.078     )
							(-0.19074327  0.01479093 -0.078     )
							(-0.18726724  0.01479544 -0.078     )
							(-0.18377268  0.01478441 -0.078     )
							(-0.18026076  0.01475774 -0.078     )
							(-0.17673261  0.01471532 -0.078     )
							(-0.17318927  0.01465708 -0.078     )
							(-0.16963176  0.01458297 -0.078     )
							(-0.16606103  0.01449295 -0.078     )
							(-0.16247796  0.01438702 -0.078     )
							(-0.15888341  0.0142652  -0.078     )
							(-0.15527815  0.01412752 -0.078     )
							(-0.15166291  0.01397405 -0.078     )
							(-0.14803836  0.01380488 -0.078     )
							(-0.14440512  0.01362014 -0.078     )
							(-0.14076373  0.01341998 -0.078     )
							(-0.13711471  0.01320458 -0.078     )
							(-0.13345849  0.01297415 -0.078     )
							(-0.12979545  0.01272893 -0.078     )
							(-0.12612593  0.01246921 -0.078     )
							(-0.12245019  0.0121953  -0.078     )
							(-0.11876843  0.01190755 -0.078     )
							(-0.11508082  0.01160634 -0.078     )
							(-0.11138744  0.01129209 -0.078     )
							(-0.10768832  0.01096526 -0.078     )
							(-0.10398345  0.01062635 -0.078     )
							(-0.10027272  0.01027591 -0.078     )
							(-0.09655599  0.00991452 -0.078     )
							(-0.09283306  0.0095428  -0.078     )
							(-0.08910366  0.00916142 -0.078     )
							(-0.08536746  0.0087711  -0.078     )
							(-0.08162407  0.00837259 -0.078     )
							(-0.07787304  0.0079667  -0.078     )
							(-0.07411385  0.00755429 -0.078     )
							(-0.07034594  0.00713625 -0.078     )
							(-0.06656866  0.00671355 -0.078     )
							(-0.06278133  0.00628718 -0.078     )
							(-0.05898316  0.0058582  -0.078     )
							(-0.05517336  0.00542773 -0.078     )
							(-0.05135101  0.00499692 -0.078     )
							(-0.04751518  0.00456699 -0.078     )

						)
		spline 4 36 (
							(-0.29993017 -0.0005169  -0.078     )
							(-0.29972306 -0.00102521 -0.078     )
							(-0.29938219 -0.00152518 -0.078     )
							(-0.29891105 -0.00201701 -0.078     )
							(-0.29831309 -0.00250088 -0.078     )
							(-0.2975917  -0.00297692 -0.078     )
							(-0.29675024 -0.00344525 -0.078     )
							(-0.29579204 -0.00390597 -0.078     )
							(-0.29472036 -0.00435913 -0.078     )
							(-0.29353842 -0.00480476 -0.078     )
							(-0.29224943 -0.00524288 -0.078     )
							(-0.29085651 -0.00567347 -0.078     )
							(-0.28936276 -0.00609649 -0.078     )
							(-0.28777123 -0.00651189 -0.078     )
							(-0.28608494 -0.00691959 -0.078     )
							(-0.28430684 -0.00731948 -0.078     )
							(-0.28243984 -0.00771146 -0.078     )
							(-0.28048683 -0.00809538 -0.078     )
							(-0.27845062 -0.00847109 -0.078     )
							(-0.276334   -0.00883843 -0.078     )
							(-0.27413969 -0.00919722 -0.078     )
							(-0.27187038 -0.00954726 -0.078     )
							(-0.26952871 -0.00988835 -0.078     )
							(-0.26711728 -0.01022026 -0.078     )
							(-0.26463862 -0.01054278 -0.078     )
							(-0.26209524 -0.01085565 -0.078     )
							(-0.25948958 -0.01115864 -0.078     )
							(-0.25682404 -0.01145149 -0.078     )
							(-0.25410098 -0.01173394 -0.078     )
							(-0.2513227  -0.01200574 -0.078     )
							(-0.24849146 -0.0122666  -0.078     )
							(-0.24560945 -0.01251627 -0.078     )
							(-0.24267885 -0.01275446 -0.078     )
							(-0.23970174 -0.0129809  -0.078     )
							(-0.2366802  -0.01319533 -0.078     )
							(-0.23361622 -0.01339746 -0.078     )
							(-0.23051177 -0.01358703 -0.078     )
							(-0.22736874 -0.01376376 -0.078     )
							(-0.224189  -0.0139274 -0.078    )
							(-0.22097435 -0.01407769 -0.078     )
							(-0.21772653 -0.01421438 -0.078     )
							(-0.21444725 -0.01433722 -0.078     )
							(-0.21113816 -0.01444598 -0.078     )
							(-0.20780086 -0.01454042 -0.078     )
							(-0.20443688 -0.01462035 -0.078     )
							(-0.20104772 -0.01468555 -0.078     )
							(-0.19763482 -0.01473582 -0.078     )
							(-0.19419956 -0.014771   -0.078     )
							(-0.19074327 -0.01479093 -0.078     )
							(-0.18726724 -0.01479544 -0.078     )
							(-0.18377268 -0.01478441 -0.078     )
							(-0.18026076 -0.01475774 -0.078     )
							(-0.17673261 -0.01471532 -0.078     )
							(-0.17318927 -0.01465708 -0.078     )
							(-0.16963176 -0.01458297 -0.078     )
							(-0.16606103 -0.01449295 -0.078     )
							(-0.16247796 -0.01438702 -0.078     )
							(-0.15888341 -0.0142652  -0.078     )
							(-0.15527815 -0.01412752 -0.078     )
							(-0.15166291 -0.01397405 -0.078     )
							(-0.14803836 -0.01380488 -0.078     )
							(-0.14440512 -0.01362014 -0.078     )
							(-0.14076373 -0.01341998 -0.078     )
							(-0.13711471 -0.01320458 -0.078     )
							(-0.13345849 -0.01297415 -0.078     )
							(-0.12979545 -0.01272893 -0.078     )
							(-0.12612593 -0.01246921 -0.078     )
							(-0.12245019 -0.0121953  -0.078     )
							(-0.11876843 -0.01190755 -0.078     )
							(-0.11508082 -0.01160634 -0.078     )
							(-0.11138744 -0.01129209 -0.078     )
							(-0.10768832 -0.01096526 -0.078     )
							(-0.10398345 -0.01062635 -0.078     )
							(-0.10027272 -0.01027591 -0.078     )
							(-0.09655599 -0.00991452 -0.078     )
							(-0.09283306 -0.0095428  -0.078     )
							(-0.08910366 -0.00916142 -0.078     )
							(-0.08536746 -0.0087711  -0.078     )
							(-0.08162407 -0.00837259 -0.078     )
							(-0.07787304 -0.0079667  -0.078     )
							(-0.07411385 -0.00755429 -0.078     )
							(-0.07034594 -0.00713625 -0.078     )
							(-0.06656866 -0.00671355 -0.078     )
							(-0.06278133 -0.00628718 -0.078     )
							(-0.05898316 -0.0058582  -0.078     )
							(-0.05517336 -0.00542773 -0.078     )
							(-0.05135101 -0.00499692 -0.078     )
							(-0.04751518 -0.00456699 -0.078     )

						)
		spline 5 29 (
							(-0.29993017  0.0005169   0.078     )
							(-0.29972306  0.00102521  0.078     )
							(-0.29938219  0.00152518  0.078     )
							(-0.29891105  0.00201701  0.078     )
							(-0.29831309  0.00250088  0.078     )
							(-0.2975917   0.00297692  0.078     )
							(-0.29675024  0.00344525  0.078     )
							(-0.29579204  0.00390597  0.078     )
							(-0.29472036  0.00435913  0.078     )
							(-0.29353842  0.00480476  0.078     )
							(-0.29224943  0.00524288  0.078     )
							(-0.29085651  0.00567347  0.078     )
							(-0.28936276  0.00609649  0.078     )
							(-0.28777123  0.00651189  0.078     )
							(-0.28608494  0.00691959  0.078     )
							(-0.28430684  0.00731948  0.078     )
							(-0.28243984  0.00771146  0.078     )
							(-0.28048683  0.00809538  0.078     )
							(-0.27845062  0.00847109  0.078     )
							(-0.276334    0.00883843  0.078     )
							(-0.27413969  0.00919722  0.078     )
							(-0.27187038  0.00954726  0.078     )
							(-0.26952871  0.00988835  0.078     )
							(-0.26711728  0.01022026  0.078     )
							(-0.26463862  0.01054278  0.078     )
							(-0.26209524  0.01085565  0.078     )
							(-0.25948958  0.01115864  0.078     )
							(-0.25682404  0.01145149  0.078     )
							(-0.25410098  0.01173394  0.078     )
							(-0.2513227   0.01200574  0.078     )
							(-0.24849146  0.0122666   0.078     )
							(-0.24560945  0.01251627  0.078     )
							(-0.24267885  0.01275446  0.078     )
							(-0.23970174  0.0129809   0.078     )
							(-0.2366802   0.01319533  0.078     )
							(-0.23361622  0.01339746  0.078     )
							(-0.23051177  0.01358703  0.078     )
							(-0.22736874  0.01376376  0.078     )
							(-0.224189   0.0139274  0.078    )
							(-0.22097435  0.01407769  0.078     )
							(-0.21772653  0.01421438  0.078     )
							(-0.21444725  0.01433722  0.078     )
							(-0.21113816  0.01444598  0.078     )
							(-0.20780086  0.01454042  0.078     )
							(-0.20443688  0.01462035  0.078     )
							(-0.20104772  0.01468555  0.078     )
							(-0.19763482  0.01473582  0.078     )
							(-0.19419956  0.014771    0.078     )
							(-0.19074327  0.01479093  0.078     )
							(-0.18726724  0.01479544  0.078     )
							(-0.18377268  0.01478441  0.078     )
							(-0.18026076  0.01475774  0.078     )
							(-0.17673261  0.01471532  0.078     )
							(-0.17318927  0.01465708  0.078     )
							(-0.16963176  0.01458297  0.078     )
							(-0.16606103  0.01449295  0.078     )
							(-0.16247796  0.01438702  0.078     )
							(-0.15888341  0.0142652   0.078     )
							(-0.15527815  0.01412752  0.078     )
							(-0.15166291  0.01397405  0.078     )
							(-0.14803836  0.01380488  0.078     )
							(-0.14440512  0.01362014  0.078     )
							(-0.14076373  0.01341998  0.078     )
							(-0.13711471  0.01320458  0.078     )
							(-0.13345849  0.01297415  0.078     )
							(-0.12979545  0.01272893  0.078     )
							(-0.12612593  0.01246921  0.078     )
							(-0.12245019  0.0121953   0.078     )
							(-0.11876843  0.01190755  0.078     )
							(-0.11508082  0.01160634  0.078     )
							(-0.11138744  0.01129209  0.078     )
							(-0.10768832  0.01096526  0.078     )
							(-0.10398345  0.01062635  0.078     )
							(-0.10027272  0.01027591  0.078     )
							(-0.09655599  0.00991452  0.078     )
							(-0.09283306  0.0095428   0.078     )
							(-0.08910366  0.00916142  0.078     )
							(-0.08536746  0.0087711   0.078     )
							(-0.08162407  0.00837259  0.078     )
							(-0.07787304  0.0079667   0.078     )
							(-0.07411385  0.00755429  0.078     )
							(-0.07034594  0.00713625  0.078     )
							(-0.06656866  0.00671355  0.078     )
							(-0.06278133  0.00628718  0.078     )
							(-0.05898316  0.0058582   0.078     )
							(-0.05517336  0.00542773  0.078     )
							(-0.05135101  0.00499692  0.078     )
							(-0.04751518  0.00456699  0.078     )

						)
		spline 5 37 (
							(-0.29993017 -0.0005169   0.078     )
							(-0.29972306 -0.00102521  0.078     )
							(-0.29938219 -0.00152518  0.078     )
							(-0.29891105 -0.00201701  0.078     )
							(-0.29831309 -0.00250088  0.078     )
							(-0.2975917  -0.00297692  0.078     )
							(-0.29675024 -0.00344525  0.078     )
							(-0.29579204 -0.00390597  0.078     )
							(-0.29472036 -0.00435913  0.078     )
							(-0.29353842 -0.00480476  0.078     )
							(-0.29224943 -0.00524288  0.078     )
							(-0.29085651 -0.00567347  0.078     )
							(-0.28936276 -0.00609649  0.078     )
							(-0.28777123 -0.00651189  0.078     )
							(-0.28608494 -0.00691959  0.078     )
							(-0.28430684 -0.00731948  0.078     )
							(-0.28243984 -0.00771146  0.078     )
							(-0.28048683 -0.00809538  0.078     )
							(-0.27845062 -0.00847109  0.078     )
							(-0.276334   -0.00883843  0.078     )
							(-0.27413969 -0.00919722  0.078     )
							(-0.27187038 -0.00954726  0.078     )
							(-0.26952871 -0.00988835  0.078     )
							(-0.26711728 -0.01022026  0.078     )
							(-0.26463862 -0.01054278  0.078     )
							(-0.26209524 -0.01085565  0.078     )
							(-0.25948958 -0.01115864  0.078     )
							(-0.25682404 -0.01145149  0.078     )
							(-0.25410098 -0.01173394  0.078     )
							(-0.2513227  -0.01200574  0.078     )
							(-0.24849146 -0.0122666   0.078     )
							(-0.24560945 -0.01251627  0.078     )
							(-0.24267885 -0.01275446  0.078     )
							(-0.23970174 -0.0129809   0.078     )
							(-0.2366802  -0.01319533  0.078     )
							(-0.23361622 -0.01339746  0.078     )
							(-0.23051177 -0.01358703  0.078     )
							(-0.22736874 -0.01376376  0.078     )
							(-0.224189  -0.0139274  0.078    )
							(-0.22097435 -0.01407769  0.078     )
							(-0.21772653 -0.01421438  0.078     )
							(-0.21444725 -0.01433722  0.078     )
							(-0.21113816 -0.01444598  0.078     )
							(-0.20780086 -0.01454042  0.078     )
							(-0.20443688 -0.01462035  0.078     )
							(-0.20104772 -0.01468555  0.078     )
							(-0.19763482 -0.01473582  0.078     )
							(-0.19419956 -0.014771    0.078     )
							(-0.19074327 -0.01479093  0.078     )
							(-0.18726724 -0.01479544  0.078     )
							(-0.18377268 -0.01478441  0.078     )
							(-0.18026076 -0.01475774  0.078     )
							(-0.17673261 -0.01471532  0.078     )
							(-0.17318927 -0.01465708  0.078     )
							(-0.16963176 -0.01458297  0.078     )
							(-0.16606103 -0.01449295  0.078     )
							(-0.16247796 -0.01438702  0.078     )
							(-0.15888341 -0.0142652   0.078     )
							(-0.15527815 -0.01412752  0.078     )
							(-0.15166291 -0.01397405  0.078     )
							(-0.14803836 -0.01380488  0.078     )
							(-0.14440512 -0.01362014  0.078     )
							(-0.14076373 -0.01341998  0.078     )
							(-0.13711471 -0.01320458  0.078     )
							(-0.13345849 -0.01297415  0.078     )
							(-0.12979545 -0.01272893  0.078     )
							(-0.12612593 -0.01246921  0.078     )
							(-0.12245019 -0.0121953   0.078     )
							(-0.11876843 -0.01190755  0.078     )
							(-0.11508082 -0.01160634  0.078     )
							(-0.11138744 -0.01129209  0.078     )
							(-0.10768832 -0.01096526  0.078     )
							(-0.10398345 -0.01062635  0.078     )
							(-0.10027272 -0.01027591  0.078     )
							(-0.09655599 -0.00991452  0.078     )
							(-0.09283306 -0.0095428   0.078     )
							(-0.08910366 -0.00916142  0.078     )
							(-0.08536746 -0.0087711   0.078     )
							(-0.08162407 -0.00837259  0.078     )
							(-0.07787304 -0.0079667   0.078     )
							(-0.07411385 -0.00755429  0.078     )
							(-0.07034594 -0.00713625  0.078     )
							(-0.06656866 -0.00671355  0.078     )
							(-0.06278133 -0.00628718  0.078     )
							(-0.05898316 -0.0058582   0.078     )
							(-0.05517336 -0.00542773  0.078     )
							(-0.05135101 -0.00499692  0.078     )
							(-0.04751518 -0.00456699  0.078     )

						)
);

boundary
(
    down
    {
        type patch;
        faces
        (
            ( 2 14 15  3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (14 10 11 15)
        );
    }
    up
    {
        type patch;
        faces
        (
            (10  8  9 11)
        );
    }
    meanFlow
    {
        type patch;
        faces
        (
            ( 8  0  1  9)
            ( 0  2  3  1)
        );
    }

    coandaUpper
    {
        type patch;
        faces
        (
            (24 22 23 25)
        );
    }

    coandaLower
    {
        type patch;
        faces
        (
            (30 32 33 31)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 4 28 29  5)
            ( 4 36 37  5)
            (28 26 27 29)
            (26 24 25 27)
            (22 30 31 23)
            (32 34 35 33)
            (34 36 37 35)
        );
    }


);
