bezier_airfoil/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            patch;
        nFaces          25;
        startFace       54060;
    }
    right
    {
        type            patch;
        nFaces          80;
        startFace       54085;
    }
    up
    {
        type            patch;
        nFaces          25;
        startFace       54165;
    }
    meanFlow
    {
        type            patch;
        nFaces          200;
        startFace       54190;
    }
    coandaUpper
    {
        type            patch;
        nFaces          5;
        startFace       54390;
    }
    coandaLower
    {
        type            patch;
        nFaces          5;
        startFace       54395;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          340;
        startFace       54400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          54400;
        startFace       54740;
    }
)

// ************************************************************************* //
