bezier_airfoil/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    surface
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    meanFlow
    {
        type            calculated;
        value           uniform 0;
    }

    coandaUpper
    {
        type            calculated;
        value           uniform 0;
    }

    coandaLower
    {
        type            calculated;
        value           uniform 0;
    }

    right
    {
        type            calculated;
        value           uniform 0;
    }

    up
    {
        type            calculated;
        value           uniform 0;
    }

    down
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
